## 🏗️ Terraform変更差分レポート

| チェック項目 | 結果 |
|------------|------|
| フォーマット確認 | ✅ |
| 文法チェック | ✅ |
| 変更差分計算 | ✅ |

<details>
<summary>📋 変更差分の詳細（クリックで展開）</summary>

```hcl
data.google_project.current: Reading...
google_service_account.cloud_functions: Refreshing state... [id=projects/soulkun-production/serviceAccounts/cloud-functions-sa@soulkun-production.iam.gserviceaccount.com]
google_storage_bucket.meeting_recordings: Refreshing state... [id=soulkun-meeting-recordings]
google_secret_manager_secret.secrets["PINECONE_API_KEY"]: Refreshing state... [id=projects/soulkun-production/secrets/PINECONE_API_KEY]
google_secret_manager_secret.secrets["SUPABASE_ANON_KEY"]: Refreshing state... [id=projects/soulkun-production/secrets/SUPABASE_ANON_KEY]
data.google_cloud_run_service.scheduler_cr_targets["weekly-summary"]: Reading...
google_artifact_registry_repository.cloud_run: Refreshing state... [id=projects/soulkun-production/locations/asia-northeast1/repositories/cloud-run]
google_secret_manager_secret.secrets["zoom-account-id"]: Refreshing state... [id=projects/soulkun-production/secrets/zoom-account-id]
google_sql_database_instance.main: Refreshing state... [id=soulkun-db]
google_secret_manager_secret.secrets["SUPABASE_SERVICE_ROLE_KEY"]: Refreshing state... [id=projects/soulkun-production/secrets/SUPABASE_SERVICE_ROLE_KEY]
google_secret_manager_secret.secrets["cloudsql-password"]: Refreshing state... [id=projects/soulkun-production/secrets/cloudsql-password]
google_secret_manager_secret.secrets["GOOGLE_AI_API_KEY"]: Refreshing state... [id=projects/soulkun-production/secrets/GOOGLE_AI_API_KEY]
google_secret_manager_secret.secrets["SOULKUN_CHATWORK_TOKEN"]: Refreshing state... [id=projects/soulkun-production/secrets/SOULKUN_CHATWORK_TOKEN]
google_secret_manager_secret.secrets["openrouter-api-key"]: Refreshing state... [id=projects/soulkun-production/secrets/openrouter-api-key]
google_secret_manager_secret.secrets["GOOGLE_SERVICE_ACCOUNT_JSON"]: Refreshing state... [id=projects/soulkun-production/secrets/GOOGLE_SERVICE_ACCOUNT_JSON]
google_secret_manager_secret.secrets["zoom-client-id"]: Refreshing state... [id=projects/soulkun-production/secrets/zoom-client-id]
google_secret_manager_secret.secrets["chatwork-api-key"]: Refreshing state... [id=projects/soulkun-production/secrets/chatwork-api-key]
google_secret_manager_secret.secrets["ANTHROPIC_API_KEY"]: Refreshing state... [id=projects/soulkun-production/secrets/ANTHROPIC_API_KEY]
data.google_project.current: Read complete after 0s [id=projects/soulkun-production]
google_secret_manager_secret.secrets["zoom-client-secret"]: Refreshing state... [id=projects/soulkun-production/secrets/zoom-client-secret]
google_storage_bucket.terraform_state: Refreshing state... [id=soulkun-terraform-state]
google_service_account.scheduler_invoker: Refreshing state... [id=projects/soulkun-production/serviceAccounts/scheduler-invoker@soulkun-production.iam.gserviceaccount.com]
data.google_cloud_run_service.scheduler_cr_targets["weekly-summary-manager"]: Reading...
data.google_cloud_run_service.scheduler_cr_targets["daily-reminder"]: Reading...
data.google_cloud_run_service.scheduler_cr_targets["proactive-monitor"]: Reading...
google_cloud_run_v2_service.proactive_monitor: Refreshing state... [id=projects/soulkun-production/locations/asia-northeast1/services/proactive-monitor]
google_cloud_run_v2_service.chatwork_webhook: Refreshing state... [id=projects/soulkun-production/locations/asia-northeast1/services/chatwork-webhook]
google_project_iam_member.cf_log_writer: Refreshing state... [id=soulkun-production/roles/logging.logWriter/serviceAccount:cloud-functions-sa@soulkun-production.iam.gserviceaccount.com]
google_project_iam_member.cf_cloudsql_client: Refreshing state... [id=soulkun-production/roles/cloudsql.client/serviceAccount:cloud-functions-sa@soulkun-production.iam.gserviceaccount.com]
google_cloudfunctions2_function.functions["report-generator"]: Refreshing state... [id=projects/soulkun-production/locations/asia-northeast1/functions/report-generator]
google_cloudfunctions2_function.functions["db-backup-export"]: Refreshing state... [id=projects/soulkun-production/locations/asia-northeast1/functions/db-backup-export]
google_cloudfunctions2_function.functions["watch_google_drive"]: Refreshing state... [id=projects/soulkun-production/locations/asia-northeast1/functions/watch_google_drive]
data.google_cloud_run_service.scheduler_cr_targets["weekly-summary"]: Read complete after 1s [id=locations/asia-northeast1/namespaces/soulkun-production/services/weekly-summary]
google_cloudfunctions2_function.functions["bottleneck-detection"]: Refreshing state... [id=projects/soulkun-production/locations/asia-northeast1/functions/bottleneck-detection]
google_cloudfunctions2_function.functions["goal-daily-reminder"]: Refreshing state... [id=projects/soulkun-production/locations/asia-northeast1/functions/goal-daily-reminder]
data.google_cloud_run_service.scheduler_cr_targets["daily-reminder"]: Read complete after 0s [id=locations/asia-northeast1/namespaces/soulkun-production/services/daily-reminder]
data.google_cloud_run_service.scheduler_cr_targets["weekly-summary-manager"]: Read complete after 0s [id=locations/asia-northeast1/namespaces/soulkun-production/services/weekly-summary-manager]
google_cloudfunctions2_function.functions["sync_drive_permissions"]: Refreshing state... [id=projects/soulkun-production/locations/asia-northeast1/functions/sync_drive_permissions]
google_cloudfunctions2_function.functions["check-reply-messages"]: Refreshing state... [id=projects/soulkun-production/locations/asia-northeast1/functions/check-reply-messages]
data.google_cloud_run_service.scheduler_cr_targets["proactive-monitor"]: Read complete after 0s [id=locations/asia-northeast1/namespaces/soulkun-production/services/proactive-monitor]
google_cloudfunctions2_function.functions["goal-daily-check"]: Refreshing state... [id=projects/soulkun-production/locations/asia-northeast1/functions/goal-daily-check]
google_cloudfunctions2_function.functions["weekly-report"]: Refreshing state... [id=projects/soulkun-production/locations/asia-northeast1/functions/weekly-report]
google_cloudfunctions2_function.functions["sync-chatwork-tasks"]: Refreshing state... [id=projects/soulkun-production/locations/asia-northeast1/functions/sync-chatwork-tasks]
google_cloudfunctions2_function.functions["cleanup-old-data"]: Refreshing state... [id=projects/soulkun-production/locations/asia-northeast1/functions/cleanup-old-data]
google_cloudfunctions2_function.functions["supabase_sync"]: Refreshing state... [id=projects/soulkun-production/locations/asia-northeast1/functions/supabase_sync]
google_cloudfunctions2_function.functions["personalization-detection"]: Refreshing state... [id=projects/soulkun-production/locations/asia-northeast1/functions/personalization-detection]
google_cloudfunctions2_function.functions["sync-room-members"]: Refreshing state... [id=projects/soulkun-production/locations/asia-northeast1/functions/sync-room-members]
google_cloudfunctions2_function.functions["goal-consecutive-unanswered"]: Refreshing state... [id=projects/soulkun-production/locations/asia-northeast1/functions/goal-consecutive-unanswered]
google_cloudfunctions2_function.functions["pattern-detection"]: Refreshing state... [id=projects/soulkun-production/locations/asia-northeast1/functions/pattern-detection]
google_cloudfunctions2_function.functions["brain-daily-aggregation"]: Refreshing state... [id=projects/soulkun-production/locations/asia-northeast1/functions/brain-daily-aggregation]
google_cloudfunctions2_function.functions["remind-tasks"]: Refreshing state... [id=projects/soulkun-production/locations/asia-northeast1/functions/remind-tasks]
google_cloudfunctions2_function.functions["goal-morning-feedback"]: Refreshing state... [id=projects/soulkun-production/locations/asia-northeast1/functions/goal-morning-feedback]
google_sql_database.main: Refreshing state... [id=projects/soulkun-production/instances/soulkun-db/databases/soulkun_tasks]
google_sql_user.main: Refreshing state... [id=soulkun_user//soulkun-db]
google_cloud_run_service_iam_member.scheduler_invoker_cloud_run["proactive-monitor"]: Refreshing state... [id=v1/projects/soulkun-production/locations/asia-northeast1/services/proactive-monitor/roles/run.invoker/serviceAccount:scheduler-invoker@soulkun-production.iam.gserviceaccount.com]
google_cloud_run_service_iam_member.scheduler_invoker_cloud_run["daily-reminder"]: Refreshing state... [id=v1/projects/soulkun-production/locations/asia-northeast1/services/daily-reminder/roles/run.invoker/serviceAccount:scheduler-invoker@soulkun-production.iam.gserviceaccount.com]
google_cloud_run_service_iam_member.scheduler_invoker_cloud_run["weekly-summary"]: Refreshing state... [id=v1/projects/soulkun-production/locations/asia-northeast1/services/weekly-summary/roles/run.invoker/serviceAccount:scheduler-invoker@soulkun-production.iam.gserviceaccount.com]
google_cloud_run_service_iam_member.scheduler_invoker_cloud_run["weekly-summary-manager"]: Refreshing state... [id=v1/projects/soulkun-production/locations/asia-northeast1/services/weekly-summary-manager/roles/run.invoker/serviceAccount:scheduler-invoker@soulkun-production.iam.gserviceaccount.com]
google_secret_manager_secret_iam_member.cf_access["cloudsql-password"]: Refreshing state... [id=projects/soulkun-production/secrets/cloudsql-password/roles/secretmanager.secretAccessor/serviceAccount:cloud-functions-sa@soulkun-production.iam.gserviceaccount.com]
google_secret_manager_secret_iam_member.cf_access["PINECONE_API_KEY"]: Refreshing state... [id=projects/soulkun-production/secrets/PINECONE_API_KEY/roles/secretmanager.secretAccessor/serviceAccount:cloud-functions-sa@soulkun-production.iam.gserviceaccount.com]
google_secret_manager_secret_iam_member.cf_access["chatwork-api-key"]: Refreshing state... [id=projects/soulkun-production/secrets/chatwork-api-key/roles/secretmanager.secretAccessor/serviceAccount:cloud-functions-sa@soulkun-production.iam.gserviceaccount.com]
google_secret_manager_secret_iam_member.cf_access["openrouter-api-key"]: Refreshing state... [id=projects/soulkun-production/secrets/openrouter-api-key/roles/secretmanager.secretAccessor/serviceAccount:cloud-functions-sa@soulkun-production.iam.gserviceaccount.com]
google_secret_manager_secret_iam_member.cf_access["zoom-account-id"]: Refreshing state... [id=projects/soulkun-production/secrets/zoom-account-id/roles/secretmanager.secretAccessor/serviceAccount:cloud-functions-sa@soulkun-production.iam.gserviceaccount.com]
google_secret_manager_secret_iam_member.cf_access["GOOGLE_AI_API_KEY"]: Refreshing state... [id=projects/soulkun-production/secrets/GOOGLE_AI_API_KEY/roles/secretmanager.secretAccessor/serviceAccount:cloud-functions-sa@soulkun-production.iam.gserviceaccount.com]
google_secret_manager_secret_iam_member.cf_access["ANTHROPIC_API_KEY"]: Refreshing state... [id=projects/soulkun-production/secrets/ANTHROPIC_API_KEY/roles/secretmanager.secretAccessor/serviceAccount:cloud-functions-sa@soulkun-production.iam.gserviceaccount.com]
google_secret_manager_secret_iam_member.cf_access["SUPABASE_ANON_KEY"]: Refreshing state... [id=projects/soulkun-production/secrets/SUPABASE_ANON_KEY/roles/secretmanager.secretAccessor/serviceAccount:cloud-functions-sa@soulkun-production.iam.gserviceaccount.com]
google_secret_manager_secret_iam_member.cf_access["SUPABASE_SERVICE_ROLE_KEY"]: Refreshing state... [id=projects/soulkun-production/secrets/SUPABASE_SERVICE_ROLE_KEY/roles/secretmanager.secretAccessor/serviceAccount:cloud-functions-sa@soulkun-production.iam.gserviceaccount.com]
google_secret_manager_secret_iam_member.cf_access["GOOGLE_SERVICE_ACCOUNT_JSON"]: Refreshing state... [id=projects/soulkun-production/secrets/GOOGLE_SERVICE_ACCOUNT_JSON/roles/secretmanager.secretAccessor/serviceAccount:cloud-functions-sa@soulkun-production.iam.gserviceaccount.com]
google_secret_manager_secret_iam_member.cf_access["SOULKUN_CHATWORK_TOKEN"]: Refreshing state... [id=projects/soulkun-production/secrets/SOULKUN_CHATWORK_TOKEN/roles/secretmanager.secretAccessor/serviceAccount:cloud-functions-sa@soulkun-production.iam.gserviceaccount.com]
google_secret_manager_secret_iam_member.cf_access["zoom-client-secret"]: Refreshing state... [id=projects/soulkun-production/secrets/zoom-client-secret/roles/secretmanager.secretAccessor/serviceAccount:cloud-functions-sa@soulkun-production.iam.gserviceaccount.com]
google_secret_manager_secret_iam_member.cf_access["zoom-client-id"]: Refreshing state... [id=projects/soulkun-production/secrets/zoom-client-id/roles/secretmanager.secretAccessor/serviceAccount:cloud-functions-sa@soulkun-production.iam.gserviceaccount.com]
google_storage_bucket_iam_member.cf_recordings_admin: Refreshing state... [id=b/soulkun-meeting-recordings/roles/storage.objectAdmin/serviceAccount:cloud-functions-sa@soulkun-production.iam.gserviceaccount.com]
google_cloud_scheduler_job.cr_jobs["daily-reminder-job"]: Refreshing state... [id=projects/soulkun-production/locations/asia-northeast1/jobs/daily-reminder-job]
google_cloud_scheduler_job.cr_jobs["proactive-monitor-hourly"]: Refreshing state... [id=projects/soulkun-production/locations/asia-northeast1/jobs/proactive-monitor-hourly]
google_cloud_scheduler_job.cr_jobs["weekly-summary-job"]: Refreshing state... [id=projects/soulkun-production/locations/asia-northeast1/jobs/weekly-summary-job]
google_cloud_scheduler_job.cr_jobs["weekly-summary-manager-job"]: Refreshing state... [id=projects/soulkun-production/locations/asia-northeast1/jobs/weekly-summary-manager-job]
google_cloud_scheduler_job.cf_jobs["weekly-report-monday"]: Refreshing state... [id=projects/soulkun-production/locations/asia-northeast1/jobs/weekly-report-monday]
google_cloud_scheduler_job.cf_jobs["goal-consecutive-unanswered-job"]: Refreshing state... [id=projects/soulkun-production/locations/asia-northeast1/jobs/goal-consecutive-unanswered-job]
google_cloud_scheduler_job.cf_jobs["goal-morning-feedback-job"]: Refreshing state... [id=projects/soulkun-production/locations/asia-northeast1/jobs/goal-morning-feedback-job]
google_cloud_scheduler_job.cf_jobs["remind-tasks-job"]: Refreshing state... [id=projects/soulkun-production/locations/asia-northeast1/jobs/remind-tasks-job]
google_cloud_scheduler_job.cf_jobs["sync-chatwork-tasks-job"]: Refreshing state... [id=projects/soulkun-production/locations/asia-northeast1/jobs/sync-chatwork-tasks-job]
google_cloud_scheduler_job.cf_jobs["goal-daily-reminder-job"]: Refreshing state... [id=projects/soulkun-production/locations/asia-northeast1/jobs/goal-daily-reminder-job]
google_cloud_scheduler_job.cf_jobs["daily-insight-notification"]: Refreshing state... [id=projects/soulkun-production/locations/asia-northeast1/jobs/daily-insight-notification]
google_cloud_scheduler_job.cf_jobs["db-backup-monthly"]: Refreshing state... [id=projects/soulkun-production/locations/asia-northeast1/jobs/db-backup-monthly]
google_cloud_scheduler_job.cf_jobs["check-reply-messages-job"]: Refreshing state... [id=projects/soulkun-production/locations/asia-northeast1/jobs/check-reply-messages-job]
google_cloud_scheduler_job.cf_jobs["sync-drive-permissions-daily"]: Refreshing state... [id=projects/soulkun-production/locations/asia-northeast1/jobs/sync-drive-permissions-daily]
google_cloud_scheduler_job.cf_jobs["daily-report-generation"]: Refreshing state... [id=projects/soulkun-production/locations/asia-northeast1/jobs/daily-report-generation]
google_cloud_scheduler_job.cf_jobs["cleanup-old-data-job"]: Refreshing state... [id=projects/soulkun-production/locations/asia-northeast1/jobs/cleanup-old-data-job]
google_cloud_scheduler_job.cf_jobs["sync-room-members-job"]: Refreshing state... [id=projects/soulkun-production/locations/asia-northeast1/jobs/sync-room-members-job]
google_cloud_scheduler_job.cf_jobs["weekly-report-generation"]: Refreshing state... [id=projects/soulkun-production/locations/asia-northeast1/jobs/weekly-report-generation]
google_cloud_scheduler_job.cf_jobs["emotion-detection-daily"]: Refreshing state... [id=projects/soulkun-production/locations/asia-northeast1/jobs/emotion-detection-daily]
google_cloud_scheduler_job.cf_jobs["sync-done-tasks-job"]: Refreshing state... [id=projects/soulkun-production/locations/asia-northeast1/jobs/sync-done-tasks-job]
google_cloud_scheduler_job.cf_jobs["personalization-detection-daily"]: Refreshing state... [id=projects/soulkun-production/locations/asia-northeast1/jobs/personalization-detection-daily]
google_cloud_scheduler_job.cf_jobs["supabase-sync-daily"]: Refreshing state... [id=projects/soulkun-production/locations/asia-northeast1/jobs/supabase-sync-daily]
google_cloud_scheduler_job.cf_jobs["bottleneck-detection-daily"]: Refreshing state... [id=projects/soulkun-production/locations/asia-northeast1/jobs/bottleneck-detection-daily]
google_cloud_scheduler_job.cf_jobs["brain-daily-aggregation"]: Refreshing state... [id=projects/soulkun-production/locations/asia-northeast1/jobs/brain-daily-aggregation]
google_cloud_scheduler_job.cf_jobs["pattern-detection-hourly"]: Refreshing state... [id=projects/soulkun-production/locations/asia-northeast1/jobs/pattern-detection-hourly]
google_cloud_scheduler_job.cf_jobs["goal-daily-check-job"]: Refreshing state... [id=projects/soulkun-production/locations/asia-northeast1/jobs/goal-daily-check-job]
google_cloud_run_service_iam_member.scheduler_invoker["goal-daily-reminder"]: Refreshing state... [id=v1/projects/soulkun-production/locations/asia-northeast1/services/goal-daily-reminder/roles/run.invoker/serviceAccount:scheduler-invoker@soulkun-production.iam.gserviceaccount.com]
google_cloud_run_service_iam_member.scheduler_invoker["goal-daily-check"]: Refreshing state... [id=v1/projects/soulkun-production/locations/asia-northeast1/services/goal-daily-check/roles/run.invoker/serviceAccount:scheduler-invoker@soulkun-production.iam.gserviceaccount.com]
google_cloud_run_service_iam_member.scheduler_invoker["bottleneck-detection"]: Refreshing state... [id=v1/projects/soulkun-production/locations/asia-northeast1/services/bottleneck-detection/roles/run.invoker/serviceAccount:scheduler-invoker@soulkun-production.iam.gserviceaccount.com]
google_cloud_run_service_iam_member.scheduler_invoker["goal-morning-feedback"]: Refreshing state... [id=v1/projects/soulkun-production/locations/asia-northeast1/services/goal-morning-feedback/roles/run.invoker/serviceAccount:scheduler-invoker@soulkun-production.iam.gserviceaccount.com]
google_cloud_run_service_iam_member.scheduler_invoker["remind-tasks"]: Refreshing state... [id=v1/projects/soulkun-production/locations/asia-northeast1/services/remind-tasks/roles/run.invoker/serviceAccount:scheduler-invoker@soulkun-production.iam.gserviceaccount.com]
google_cloud_run_service_iam_member.scheduler_invoker["personalization-detection"]: Refreshing state... [id=v1/projects/soulkun-production/locations/asia-northeast1/services/personalization-detection/roles/run.invoker/serviceAccount:scheduler-invoker@soulkun-production.iam.gserviceaccount.com]
google_cloud_run_service_iam_member.scheduler_invoker["weekly-report"]: Refreshing state... [id=v1/projects/soulkun-production/locations/asia-northeast1/services/weekly-report/roles/run.invoker/serviceAccount:scheduler-invoker@soulkun-production.iam.gserviceaccount.com]
google_cloud_run_service_iam_member.scheduler_invoker["sync-chatwork-tasks"]: Refreshing state... [id=v1/projects/soulkun-production/locations/asia-northeast1/services/sync-chatwork-tasks/roles/run.invoker/serviceAccount:scheduler-invoker@soulkun-production.iam.gserviceaccount.com]
google_cloud_run_service_iam_member.scheduler_invoker["db-backup-export"]: Refreshing state... [id=v1/projects/soulkun-production/locations/asia-northeast1/services/db-backup-export/roles/run.invoker/serviceAccount:scheduler-invoker@soulkun-production.iam.gserviceaccount.com]
google_cloud_run_service_iam_member.scheduler_invoker["brain-daily-aggregation"]: Refreshing state... [id=v1/projects/soulkun-production/locations/asia-northeast1/services/brain-daily-aggregation/roles/run.invoker/serviceAccount:scheduler-invoker@soulkun-production.iam.gserviceaccount.com]
google_cloud_run_service_iam_member.scheduler_invoker["supabase_sync"]: Refreshing state... [id=v1/projects/soulkun-production/locations/asia-northeast1/services/supabase-sync/roles/run.invoker/serviceAccount:scheduler-invoker@soulkun-production.iam.gserviceaccount.com]
google_cloud_run_service_iam_member.scheduler_invoker["sync-room-members"]: Refreshing state... [id=v1/projects/soulkun-production/locations/asia-northeast1/services/sync-room-members/roles/run.invoker/serviceAccount:scheduler-invoker@soulkun-production.iam.gserviceaccount.com]
google_cloud_run_service_iam_member.scheduler_invoker["report-generator"]: Refreshing state... [id=v1/projects/soulkun-production/locations/asia-northeast1/services/report-generator/roles/run.invoker/serviceAccount:scheduler-invoker@soulkun-production.iam.gserviceaccount.com]
google_cloud_run_service_iam_member.scheduler_invoker["sync_drive_permissions"]: Refreshing state... [id=v1/projects/soulkun-production/locations/asia-northeast1/services/sync-drive-permissions/roles/run.invoker/serviceAccount:scheduler-invoker@soulkun-production.iam.gserviceaccount.com]
google_cloud_run_service_iam_member.scheduler_invoker["cleanup-old-data"]: Refreshing state... [id=v1/projects/soulkun-production/locations/asia-northeast1/services/cleanup-old-data/roles/run.invoker/serviceAccount:scheduler-invoker@soulkun-production.iam.gserviceaccount.com]
google_cloud_run_service_iam_member.scheduler_invoker["check-reply-messages"]: Refreshing state... [id=v1/projects/soulkun-production/locations/asia-northeast1/services/check-reply-messages/roles/run.invoker/serviceAccount:scheduler-invoker@soulkun-production.iam.gserviceaccount.com]
google_cloud_run_service_iam_member.scheduler_invoker["goal-consecutive-unanswered"]: Refreshing state... [id=v1/projects/soulkun-production/locations/asia-northeast1/services/goal-consecutive-unanswered/roles/run.invoker/serviceAccount:scheduler-invoker@soulkun-production.iam.gserviceaccount.com]
google_cloud_run_service_iam_member.scheduler_invoker["pattern-detection"]: Refreshing state... [id=v1/projects/soulkun-production/locations/asia-northeast1/services/pattern-detection/roles/run.invoker/serviceAccount:scheduler-invoker@soulkun-production.iam.gserviceaccount.com]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform planned the following actions, but then encountered a problem:

  # google_artifact_registry_repository.cloud_run will be updated in-place
  ~ resource "google_artifact_registry_repository" "cloud_run" {
      ~ description            = "Cloud Run service images" -> "Cloud Run コンテナイメージ保存場所"
        id                     = "projects/soulkun-production/locations/asia-northeast1/repositories/cloud-run"
        name                   = "cloud-run"
        # (11 unchanged attributes hidden)
    }

  # google_cloud_run_v2_service.chatwork_webhook will be updated in-place
  ~ resource "google_cloud_run_v2_service" "chatwork_webhook" {
      - client                  = "gcloud" -> null
      - client_version          = "556.0.0" -> null
      ~ custom_audiences        = [
          - "https://asia-northeast1-soulkun-production.cloudfunctions.net/chatwork-webhook",
        ]
        id                      = "projects/soulkun-production/locations/asia-northeast1/services/chatwork-webhook"
        name                    = "chatwork-webhook"
        # (24 unchanged attributes hidden)

      ~ template {
          ~ annotations                      = {
              - "cloudfunctions.googleapis.com/trigger-type" = "HTTP_TRIGGER" -> null
            }
          ~ labels                           = {
              - "goog-drz-cloudfunctions-id"       = "chatwork-webhook" -> null
              - "goog-drz-cloudfunctions-location" = "asia-northeast1" -> null
            }
          ~ service_account                  = "898513057014-compute@developer.gserviceaccount.com" -> (known after apply)
            # (3 unchanged attributes hidden)

          ~ containers {
              - name       = "worker" -> null
                # (4 unchanged attributes hidden)

                # (28 unchanged blocks hidden)
            }

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

  # google_cloud_run_v2_service.proactive_monitor will be updated in-place
  ~ resource "google_cloud_run_v2_service" "proactive_monitor" {
      - client                  = "gcloud" -> null
      - client_version          = "556.0.0" -> null
      ~ custom_audiences        = [
          - "https://asia-northeast1-soulkun-production.cloudfunctions.net/proactive-monitor",
        ]
        id                      = "projects/soulkun-production/locations/asia-northeast1/services/proactive-monitor"
        name                    = "proactive-monitor"
        # (24 unchanged attributes hidden)

      ~ template {
          ~ annotations                      = {
              - "cloudfunctions.googleapis.com/trigger-type" = "HTTP_TRIGGER" -> null
            }
          ~ labels                           = {
              - "goog-drz-cloudfunctions-id"       = "proactive-monitor" -> null
              - "goog-drz-cloudfunctions-location" = "asia-northeast1" -> null
            }
          ~ service_account                  = "898513057014-compute@developer.gserviceaccount.com" -> (known after apply)
            # (3 unchanged attributes hidden)

          ~ containers {
              - name       = "worker" -> null
                # (4 unchanged attributes hidden)

                # (18 unchanged blocks hidden)
            }

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

  # google_cloud_run_v2_service_iam_member.chatwork_webhook_public will be created
  + resource "google_cloud_run_v2_service_iam_member" "chatwork_webhook_public" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + location = "asia-northeast1"
      + member   = "allUsers"
      + name     = "chatwork-webhook"
      + project  = (known after apply)
      + role     = "roles/run.invoker"
    }

  # google_cloud_run_v2_service_iam_member.proactive_monitor_invoker will be created
  + resource "google_cloud_run_v2_service_iam_member" "proactive_monitor_invoker" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + location = "asia-northeast1"
      + member   = (known after apply)
      + name     = "proactive-monitor"
      + project  = (known after apply)
      + role     = "roles/run.invoker"
    }

  # google_project_iam_member.cloud_run_cloudsql_client will be created
  + resource "google_project_iam_member" "cloud_run_cloudsql_client" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "soulkun-production"
      + role    = "roles/cloudsql.client"
    }

  # google_project_iam_member.cloud_run_log_writer will be created
  + resource "google_project_iam_member" "cloud_run_log_writer" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "soulkun-production"
      + role    = "roles/logging.logWriter"
    }

  # google_project_iam_member.cloud_run_secret_accessor will be created
  + resource "google_project_iam_member" "cloud_run_secret_accessor" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "soulkun-production"
      + role    = "roles/secretmanager.secretAccessor"
    }

  # google_secret_manager_secret.secrets["TAVILY_API_KEY"] will be created
  + resource "google_secret_manager_secret" "secrets" {
      + create_time           = (known after apply)
      + effective_annotations = (known after apply)
      + effective_labels      = (known after apply)
      + expire_time           = (known after apply)
      + id                    = (known after apply)
      + name                  = (known after apply)
      + project               = "soulkun-production"
      + secret_id             = "TAVILY_API_KEY"
      + terraform_labels      = (known after apply)

      + replication {
          + auto {
            }
        }
    }

  # google_secret_manager_secret_iam_member.cf_access["TAVILY_API_KEY"] will be created
  + resource "google_secret_manager_secret_iam_member" "cf_access" {
      + etag      = (known after apply)
      + id        = (known after apply)
      + member    = "serviceAccount:cloud-functions-sa@soulkun-production.iam.gserviceaccount.com"
      + project   = (known after apply)
      + role      = "roles/secretmanager.secretAccessor"
      + secret_id = "TAVILY_API_KEY"
    }

  # google_service_account.cloud_run_sa will be created
  + resource "google_service_account" "cloud_run_sa" {
      + account_id   = "cloud-run-sa"
      + description  = "Service account for Cloud Run services (chatwork-webhook, proactive-monitor)"
      + disabled     = false
      + display_name = "Cloud Run Service Account"
      + email        = (known after apply)
      + id           = (known after apply)
      + member       = (known after apply)
      + name         = (known after apply)
      + project      = "soulkun-production"
      + unique_id    = (known after apply)
    }

  # google_storage_bucket_iam_member.cloud_run_recordings_admin will be created
  + resource "google_storage_bucket_iam_member" "cloud_run_recordings_admin" {
      + bucket = "soulkun-meeting-recordings"
      + etag   = (known after apply)
      + id     = (known after apply)
      + member = (known after apply)
      + role   = "roles/storage.objectAdmin"
    }

Plan: 9 to add, 3 to change, 0 to destroy.

Changes to Outputs:
  + chatwork_webhook_url       = "https://chatwork-webhook-tzu7ftekzq-an.a.run.app"
  + cloud_run_sa_email         = (known after apply)
  + proactive_monitor_url      = "https://proactive-monitor-tzu7ftekzq-an.a.run.app"

```

</details>

> **注意**: このPlanは読み取り専用です。実際のインフラ変更は本番デプロイ時のみ行われます。
> 変更を本番に適用するには、マージ後に手動で `terraform apply` を実行してください。
> ⚠️ このPlanは既存state未参照（-backend=false）のため、実際の差分と異なる場合があります。

*最終更新: 2026/2/19 8:27:53*